class BotMessages:
    start_message = "سلام خوش مرام. \nبه بازوی نیکو خوش آمدی."
    get_code_message = "این کد دعوت مختص شماست!\n" \
                       "با استفاده از این کد می‌تونی اقدام به دعوت دوستانت برای اضافه شدن به " \
                       "لیست نزدیکانت کنی. \nدرخواست قرض شما برای نزدیکانت بصورت گمنام ارسال میشود."
    enter_code_message = "لطفا کد دعوت دوستتان را وارد کنید تا جزو نزدیکان او شوید:\n"
    enter_code_confirmed = "تبریک! با موفقیت به لیست نزدیکان رفیقت اضافه شدی.\n"
    enter_code_failed = "مشکلی در اضافه‌شدن پیش‌ اومده:(.\n"
    display_credit_message = "شما به مقدار زیر امتیاز داری:\n"
    credit_info_message = "هر امتیاز برابر با ۱۰۰۰ تومان اعتبار است.\n"
    unknown_command_message = "دستور وارد شده معتبر نیست\n"
    terms_of_use = "همراه عزیز این بازو با هدف تسهیل و ترویج سنت اسلامی قرض الحسنه در اختیار شما است. شما در این بازو " \
                   "میتوانید در هر لحظه تا هزار برابر امتیازی که دارید، از نزدیکان خود درخواست قرض کنید. هر فرد یک کد " \
                   "دعوت دارد و کسانی که کد دعوت شما را در قسمت مربوطه در بازو وارد کنند، جزو نزدیکان شما خواهند شد. " \
                   "درخواست قرض شما به صورت گمنام برای همه نزدیکان شما ارسال میشود و هر یک از نزدیکان میتوانند در حد " \
                   "وسع خود کمک کنند. در صورتی که مبلغ مورد نیازتان تامین شود، سایرین دیگر امکان پرداخت ندارند. هر " \
                   "چقدر که شما زودتر از زمان مقرر قرض خود را بازپس دهید، امتیاز بیشتری اخذ میکنید و هر چقدر که دیرتر " \
                   "از زمان معهود قرض را بازپس دهید، امتیاز منفی بیشتری اخذ میکنید. "
    request_debt_amount_message = "شما به مقدار زیر اعتبار باقی‌مانده داری:\n"
    request_debt_message = "لطفا میزان وجه درخواستی خود را وارد کن:\n"
    request_debt_failed = "میزان قرض درخواستی از اعتبار فعلی شما بیشتر است.\n"
    request_debt_succeed = "درخواست شما تایید شد و به نزدیکان شما بصورت گمنام ارسال میشود.\n" \
                           "پولهای واریز شده به اطلاع شما خواهند رسید.\n"

    unknown_error = "مشکلی پیش آمده است.\n"

    notify_debt_title_1 = "یکی از دوستانت تقاضای قرض به مبلغ "
    notify_debt_title_2 = " کرده. در صورت تمایل می‌تونی بهش قرض بدی.\n"
