class BotMessages:
    start_message = "سلام. به بات نیکو خوش آمدید."
    get_code_message = "این کد مختص شماست!\n" \
                       "با استفاده از آن می‌توانید اقدام به دعوت نزدیکان برای اضافه شدن به " \
                       "لیستتان کنید."
    enter_code_message = "لطفا کد مربوطه را وارد کنید:\n"
    enter_code_confirmed = "شما با موفقیت اضافه شدید.\n"
    enter_code_failed = "مشکلی در اضافه‌شدن پیش‌آمده است.\n"
    display_credit_message = "شما به مقدار زیر امتیاز دارید:\n"
    credit_info_message = "هر امتیاز برابر با ۱۰۰۰ تومان اعتبار است.\n"
    unknown_command_message = "دستور وارد شده معتبر نمی‌باشد\n"
    terms_of_use = "همراه عزیز این بازو با هدف تسهیل و ترویج سنت اسلامی قرض الحسنه در اختیار شما است. شما در این بازو " \
                   "میتوانید در هر لحظه تا هزار برابر امتیازی که دارید، از نزدیکان خود درخواست قرض کنید. هر فرد یک کد " \
                   "دعوت دارد و کسانی که کد دعوت شما را در قسمت مربوطه در بازو وارد کنند، جزو نزدیکان شما خواهند شد. " \
                   "درخواست قرض شما به صورت گمنام برای همه نزدیکان شما ارسال میشود و هر یک از نزدیکان میتوانند در حد " \
                   "وسع خود کمک کنند. در صورتی که مبلغ مورد نیازتان تامین شود، سایرین دیگر امکان پرداخت ندارند. هر " \
                   "چقدر که شما زودتر از زمان مقرر قرض خود را بازپس دهید، امتیاز بیشتری اخذ میکنید و هر چقدر که دیرتر " \
                   "از زمان معهود قرض را بازپس دهید، امتیاز منفی بیشتری اخذ میکنید. "
    request_debt_amount_message = "شما به مقدار زیر اعتبار باقی‌مانده دارید:\n"
    request_debt_message = "لطفا میزان وجه درخواستی خود را وارد کنید:\n"
    request_debt_failed = "میزان قرض درخواستی از اعتبار فعلی شما بیشتر است.\n"
    request_debt_succeed = "درخواست شما قبول شد.\n" \
                           "وجه‌های واریزی به اطلاع شما خواهند رسید.\n"
